Долома/src/Documents/ДобавлениеЖивотного/ДобавлениеЖивотного.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДобавлениеЖивотного</name>
  <comment>Документ вносит данные о рождении о купленных или существующих коров</comment>
  <registerRecords>InformationRegister.ДатаПредполагамогоЗапуска</registerRecords>
  <registerRecords>InformationRegister.СостояниеЖивотных</registerRecords>
  <registerRecords>InformationRegister.РодителиЖивотных</registerRecords>
  <registerRecords>InformationRegister.Отелы</registerRecords>
  <registerRecords>InformationRegister.ДатаПредполагаемогоОтёла</registerRecords>
  <registerRecords>InformationRegister.ПроизводственныеГруппы</registerRecords>
  <registerRecords>InformationRegister.ИнформацияОРождении</registerRecords>
  <registerRecords>InformationRegister.Взвешивания</registerRecords>
  <registerRecords>InformationRegister.Осеменения</registerRecords>
  <registerRecords>InformationRegister.УЗИисследования</registerRecords>
  <registerRecords>InformationRegister.РазмещениеЖивотных</registerRecords>
  <attributes>
    <name>Ферма</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Животные</name>
    <attributes>
      <name>Кличка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Бирка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БиркаХорриот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЖивотного</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Животное</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>КорпусРазмещения</name>
      <type>
        <types>CatalogRef.Корпуса</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесТеленка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолТеленка</name>
      <type>
        <types>EnumRef.ПолЖивотного</types>
      </type>
    </attributes>
    <attributes>
      <name>Мать</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>Отец</name>
      <type>
        <types>CatalogRef.БыкиПлеменные</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоРождения</name>
      <type>
        <types>CatalogRef.Фермы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолеСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеДанныеЖивотных</name>
    <attributes>
      <name>ПолеСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОсеменений</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Семя</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнегоОсеменения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнегоУЗИ</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЖивотного</name>
      <type>
        <types>EnumRef.СтатусЖивотного</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтелов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнегоОтела</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кличка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПредполагаемоегоОтела</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗапуска</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПереводаВоВторойСухостой</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Долома/src/Enums/ПолЖивотного/ПолЖивотного.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолЖивотного</name>
  <enumValues>
    <name>Корова</name>
  </enumValues>
  <enumValues>
    <name>Бык</name>
  </enumValues>
</mdclass:Enum>

Долома/src/Documents/ДобавлениеЖивотного/Forms/ФормаВыбораСвязи/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДанныеКоллекцияОсновнойФормы = ВладелецФормы.Объект.Животные;
	
	Для каждого СтрокаКоллекции Из ДанныеКоллекцияОсновнойФормы Цикл
		
		Если Не СтрокаКоллекции.ПолТеленка = ПредопределенноеЗначение("Перечисление.ПолЖивотного.Корова") Тогда
			
			Продолжить;
		КонецЕсли;
			
		НоваяСтрокаСписка = СписокЖивотных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСписка, СтрокаКоллекции);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЖивотныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповестить("СвязьЖивотногоИДопИнформации", Элементы.СписокЖивотных.ТекущиеДанные.ПолеСвязи, ВладелецФормы);
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЖивотныхПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры
